Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗакупочная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВибыНоменклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемныйБлок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AccumulationRegisters/ОстаткиНаСкладе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНаСкладе</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склады</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/Номенклатура/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ДоступностьПартии; 
	Если Параметры.Свойство("ОтображатьЦену",ОтображатьЦену) Тогда
		Если ОтображатьЦену Тогда
			Элементы.ЦенаЗакупочная.Видимость = Истина;
			Элементы.ЦенаПоступления.Видимость = Истина;
		Иначе	
			Элементы.ЦенаЗакупочная.Видимость = Ложь;
			Элементы.ЦенаПоступления.Видимость = Ложь;
		КонецЕсли;	
	КонецЕсли;
	Если Параметры.Свойство("ДоступностьПартии",ДоступностьПартии) Тогда 
		Если ДоступностьПартии Тогда 
			Элементы.Партия.Доступность=Истина;
		Иначе
			Элементы.Партия.Доступность=Ложь;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Купить1КГНаСервере(Товар, Партия, Склад)
	ДокументПрихода = Партия.ПолучитьОбъект();
	ДокументПрихода.Движения.ОстаткиНаСкладе.Записывать = Истина;
	Набор =  ДокументПрихода.Движения.ОстаткиНаСкладе;
	//Набор.Прочитать();
	Движение = Набор.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = ТекущаяДата();
	Движение.Номенклатура = Товар;
	Движение.Склады = Склад;
	Движение.Количество = 1;
	Набор.Записать(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Купить1КГ(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Или Не ЗначениеЗаполнено(Объект.Партия) Тогда
		Купить1КГНаСервере(Объект.Ссылка,Объект.Партия, Объект.Склад);
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Купить2КГНаСервере(Товар, Партия, Склад)
	Набор = РегистрыНакопления.ОстаткиНаСкладе.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Значение = Партия;
	Запись = Набор.ДобавитьПриход();
	Запись.Период = ТекущаяДата();
	Запись.Номенклатура = Товар;
	Запись.Количество = 2;
	Запись.Склады = Склад;
	//Набор.Записать();	
	Набор.Записать(Ложь);	

КонецПроцедуры

&НаКлиенте
Процедура Купить2КГ(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Или Не ЗначениеЗаполнено(Объект.Партия) Тогда
		Купить2КГНаСервере(Объект.Ссылка,Объект.Партия,Объект.Склад);
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Купить3КГНаСервере(Товар, Партия, Склад)
	ДокументПрихода = Партия.ПолучитьОбъект();
	ДокументПрихода.Движения.ОстаткиНаСкладе.Добавить3Кг(Товар,Склад);	
КонецПроцедуры

&НаКлиенте
Процедура Купить3КГ(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Или Не ЗначениеЗаполнено(Объект.Партия) Тогда
		Купить3КГНаСервере(Объект.Ссылка,Объект.Партия,Объект.Склад);
	КонецЕсли; 

КонецПроцедуры


&НаСервере
Процедура АртикулПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаписьЖурналаРегистрации("Номенклатура.ИзменениеАртикула",   УровеньЖурналаРегистрации.Информация,,Объект.Ссылка ,
		"Изменение артикула по товару "+Объект.Ссылка+" старый артикул" + Объект.ссылка.Артикул+ " новый артикул " + Объект.Артикул);
	КонецЕсли; 

КонецПроцедуры


&НаКлиенте
Процедура АртикулПриИзменении(Элемент)
	АртикулПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЦенаПоступленияПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаписьЖурналаРегистрации("Номенклатура.ИзменениеЦены",   УровеньЖурналаРегистрации.Информация,,Объект.Ссылка ,
		"Изменение цены по номенклатуре "+Объект.Ссылка+" старая цена " + Объект.Ссылка.ЦенаПоступления+ " новая цена " + Объект.ЦенаПоступления);
	Иначе
		
		ЗаписьЖурналаРегистрации("Номенклатура.ИзменениеЦены",   УровеньЖурналаРегистрации.Информация,, ,
		"Установка цены номенклатуры "+Объект.Наименование+ " цена " + Объект.ЦенаПоступления);
		
		
	КонецЕсли; 

КонецПроцедуры


&НаКлиенте
Процедура ЦенаПоступленияПриИзменении(Элемент)
	ЦенаПоступленияПриИзмененииНаСервере();
КонецПроцедуры
